#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket_policy.apidoc_policy: Refreshing state... [id=apidoc-dev.constellationnetwork.io]
aws_s3_bucket_website_configuration.apidoc_website: Refreshing state... [id=apidoc-dev.constellationnetwork.io]
aws_s3_bucket_acl.apidoc_acl: Refreshing state... [id=apidoc-dev.constellationnetwork.io,public-read]
aws_s3_bucket.apidoc: Refreshing state... [id=apidoc-dev.constellationnetwork.io]
module.openapi_dag_node_owner.null_resource.openapi_static: Refreshing state... [id=2511294932771947361]
module.openapi_currency_node_public_l1.null_resource.openapi: Refreshing state... [id=3796778322273561610]
module.openapi_currency_node_owner.null_resource.openapi_static: Refreshing state... [id=2568869918912438447]
module.openapi_block_explorer.null_resource.openapi: Refreshing state... [id=4295760463823826774]
module.openapi_currency_node_public_l1.null_resource.openapi_static: Refreshing state... [id=1073302237280804701]
module.openapi_currency_node_owner.null_resource.openapi: Refreshing state... [id=4860451509173721471]
module.openapi_currency_node_public_l0.null_resource.openapi_static: Refreshing state... [id=3403744108220844123]
module.openapi_currency_node_public_l0.null_resource.openapi: Refreshing state... [id=5110296959147490106]
module.openapi_block_explorer.null_resource.openapi_static: Refreshing state... [id=19858377864617618]
module.openapi_dag_node_public_l0.null_resource.openapi: Refreshing state... [id=4307691963824825266]
module.openapi_dag_node_public_l1.null_resource.openapi_static: Refreshing state... [id=6647586722355065907]
module.openapi_dag_node_public_l1.null_resource.openapi: Refreshing state... [id=436946949241450834]
module.openapi_dag_node_owner.null_resource.openapi: Refreshing state... [id=884558704026790781]
module.openapi_dag_node_public_l0.null_resource.openapi_static: Refreshing state... [id=8219355153127151635]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.apidoc will be destroyed
  # (because aws_s3_bucket.apidoc is not in configuration)
  - resource "aws_s3_bucket" "apidoc" {
      - acl                                  = "public-read" -> null
      - arn                                  = "arn:aws:s3:::apidoc-dev.constellationnetwork.io" -> null
      - bucket                               = "apidoc-dev.constellationnetwork.io" -> null
      - bucket_domain_name                   = "apidoc-dev.constellationnetwork.io.s3.amazonaws.com" -> null
      - bucket_regional_domain_name          = "apidoc-dev.constellationnetwork.io.s3.us-west-1.amazonaws.com" -> null
      - cors_rule                            = [] -> null
      - force_destroy                        = false -> null
      - grant                                = [] -> null
      - hosted_zone_id                       = "Z2F56UZL2M1ACD" -> null
      - id                                   = "apidoc-dev.constellationnetwork.io" -> null
      - lifecycle_rule                       = [] -> null
      - logging                              = [] -> null
      - object_lock_enabled                  = false -> null
      - policy                               = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::apidoc-dev.constellationnetwork.io/*"
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                               = "us-west-1" -> null
      - replication_configuration            = [] -> null
      - request_payer                        = "BucketOwner" -> null
      - server_side_encryption_configuration = [
          - {
              - rule = [
                  - {
                      - apply_server_side_encryption_by_default = [
                          - {
                              - sse_algorithm     = "AES256"
                                # (1 unchanged attribute hidden)
                            },
                        ]
                      - bucket_key_enabled                      = false
                    },
                ]
            },
        ] -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - versioning                           = [
          - {
              - enabled    = false
              - mfa_delete = false
            },
        ] -> null
      - website                              = [
          - {
              - error_document           = "error.html"
              - index_document           = "index.html"
                # (2 unchanged attributes hidden)
            },
        ] -> null
      - website_domain                       = "s3-website-us-west-1.amazonaws.com" -> null
      - website_endpoint                     = "apidoc-dev.constellationnetwork.io.s3-website-us-west-1.amazonaws.com" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_acl.apidoc_acl will be destroyed
  # (because aws_s3_bucket_acl.apidoc_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "apidoc_acl" {
      - acl                   = "public-read" -> null
      - bucket                = "apidoc-dev.constellationnetwork.io" -> null
      - id                    = "apidoc-dev.constellationnetwork.io,public-read" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name  = "mathias" -> null
                  - id            = "4703bc40191fc182858b9e5ec1ab807bca95b64133830d933414677ee8550e84" -> null
                  - type          = "CanonicalUser" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - owner {
              - display_name = "mathias" -> null
              - id           = "4703bc40191fc182858b9e5ec1ab807bca95b64133830d933414677ee8550e84" -> null
            }
        }
    }

  # aws_s3_bucket_policy.apidoc_policy will be destroyed
  # (because aws_s3_bucket_policy.apidoc_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "apidoc_policy" {
      - bucket = "apidoc-dev.constellationnetwork.io" -> null
      - id     = "apidoc-dev.constellationnetwork.io" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:GetObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::apidoc-dev.constellationnetwork.io/*",
                        ]
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_website_configuration.apidoc_website will be destroyed
  # (because aws_s3_bucket_website_configuration.apidoc_website is not in configuration)
  - resource "aws_s3_bucket_website_configuration" "apidoc_website" {
      - bucket                = "apidoc-dev.constellationnetwork.io" -> null
      - id                    = "apidoc-dev.constellationnetwork.io" -> null
      - website_domain        = "s3-website-us-west-1.amazonaws.com" -> null
      - website_endpoint      = "apidoc-dev.constellationnetwork.io.s3-website-us-west-1.amazonaws.com" -> null
        # (1 unchanged attribute hidden)

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }

  # module.bucket.aws_s3_bucket.apidoc will be created
  + resource "aws_s3_bucket" "apidoc" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "apidoc-dev.constellationnetwork.io"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags_all                             = (known after apply)
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration (known after apply)
    }

  # module.bucket.aws_s3_bucket_acl.apidoc_acl will be created
  + resource "aws_s3_bucket_acl" "apidoc_acl" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # module.bucket.aws_s3_bucket_ownership_controls.apidoc_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "apidoc_ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.bucket.aws_s3_bucket_policy.apidoc_policy will be created
  + resource "aws_s3_bucket_policy" "apidoc_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::apidoc-dev.constellationnetwork.io/*",
                        ]
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.bucket.aws_s3_bucket_public_access_block.apidoc_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "apidoc_public_access" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.bucket.aws_s3_bucket_website_configuration.apidoc_website will be created
  + resource "aws_s3_bucket_website_configuration" "apidoc_website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # module.openapi_block_explorer.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "4295760463823826774" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "57d84bf59973e5749cffcacb99cd431b21bb04cf"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "block-explorer"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_block_explorer.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "19858377864617618" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_owner.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "4860451509173721471" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "5a7ea6896ea693a309dd32d2667d22dbbc804a0f"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "currency/v1/cli"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_owner.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "2568869918912438447" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_public_l0.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "5110296959147490106" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "42f36faad3097c2a3d05a9b12d5dce0368439261"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "currency/v1/l0/public"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_public_l0.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "3403744108220844123" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_public_l1.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "3796778322273561610" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "0dc624bf77e7086be8e9481a20ce859c793a8b90"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "currency/v1/l1/public"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_currency_node_public_l1.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "1073302237280804701" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_owner.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "884558704026790781" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "4ac5ec5d364342d3056c74b219ad8d8425c8059a"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "dag/cli"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_owner.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "2511294932771947361" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_public_l0.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "4307691963824825266" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "98806437c73a340b770a9ec81fde2de1d7b5abd1"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "dag/l0/public"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_public_l0.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "8219355153127151635" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_public_l1.null_resource.openapi must be replaced
-/+ resource "null_resource" "openapi" {
      ~ id       = "436946949241450834" -> (known after apply)
      ~ triggers = { # forces replacement
          - "openapi_spec_sha1" = "217ad0ea27df0e60bce371ffae2acb03be92613d"
          - "s3_bucket_path"    = "apidoc-dev.constellationnetwork.io"
          - "s3_prefix"         = "dag/l1/public"
        } -> (known after apply) # forces replacement
    }

  # module.openapi_dag_node_public_l1.null_resource.openapi_static must be replaced
-/+ resource "null_resource" "openapi_static" {
      ~ id       = "6647586722355065907" -> (known after apply)
      ~ triggers = { # forces replacement
          - "s3_bucket_path" = "apidoc-dev.constellationnetwork.io"
        } -> (known after apply) # forces replacement
    }

Plan: 20 to add, 0 to change, 18 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kpudlik, Action: `pull_request`*